; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-34)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 0 of 34
2. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 0 of 34
3. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 1 of 34
4. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 1 of 34
5. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 1 of 34
6. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 1 of 34
7. (drop ball8 room4 left)
   deleted: (carry ball8 left)
   added: (at ball8 room4) (free left)
   goals met: 2 of 34
8. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 2 of 34
9. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 2 of 34
10. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 2 of 34
11. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 3 of 34
12. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 3 of 34
13. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 3 of 34
14. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 3 of 34
15. (drop ball6 room4 left)
   deleted: (carry ball6 left)
   added: (at ball6 room4) (free left)
   goals met: 4 of 34
16. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 4 of 34
17. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 4 of 34
18. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 4 of 34
19. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 5 of 34
20. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 5 of 34
21. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 5 of 34
22. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 5 of 34
23. (drop ball4 room4 left)
   deleted: (carry ball4 left)
   added: (at ball4 room4) (free left)
   goals met: 6 of 34
24. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 6 of 34
25. (pick ball34 rooma left)
   deleted: (at ball34 rooma) (free left)
   added: (carry ball34 left)
   goals met: 6 of 34
26. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 6 of 34
27. (drop ball34 room4 left)
   deleted: (carry ball34 left)
   added: (at ball34 room4) (free left)
   goals met: 7 of 34
28. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 7 of 34
29. (pick ball33 rooma left)
   deleted: (at ball33 rooma) (free left)
   added: (carry ball33 left)
   goals met: 7 of 34
30. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 7 of 34
31. (drop ball33 room4 left)
   deleted: (carry ball33 left)
   added: (at ball33 room4) (free left)
   goals met: 8 of 34
32. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 8 of 34
33. (pick ball32 rooma left)
   deleted: (at ball32 rooma) (free left)
   added: (carry ball32 left)
   goals met: 8 of 34
34. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 8 of 34
35. (drop ball32 room4 left)
   deleted: (carry ball32 left)
   added: (at ball32 room4) (free left)
   goals met: 9 of 34
36. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 9 of 34
37. (pick ball31 rooma left)
   deleted: (at ball31 rooma) (free left)
   added: (carry ball31 left)
   goals met: 9 of 34
38. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 9 of 34
39. (drop ball31 room4 left)
   deleted: (carry ball31 left)
   added: (at ball31 room4) (free left)
   goals met: 10 of 34
40. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 10 of 34
41. (pick ball30 rooma left)
   deleted: (at ball30 rooma) (free left)
   added: (carry ball30 left)
   goals met: 10 of 34
42. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 10 of 34
43. (drop ball30 room4 left)
   deleted: (carry ball30 left)
   added: (at ball30 room4) (free left)
   goals met: 11 of 34
44. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 11 of 34
45. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 11 of 34
46. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 11 of 34
47. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 12 of 34
48. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 12 of 34
49. (pick ball29 rooma left)
   deleted: (at ball29 rooma) (free left)
   added: (carry ball29 left)
   goals met: 12 of 34
50. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 12 of 34
51. (drop ball29 room4 left)
   deleted: (carry ball29 left)
   added: (at ball29 room4) (free left)
   goals met: 13 of 34
52. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 13 of 34
53. (pick ball28 rooma left)
   deleted: (at ball28 rooma) (free left)
   added: (carry ball28 left)
   goals met: 13 of 34
54. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 13 of 34
55. (drop ball28 room4 left)
   deleted: (carry ball28 left)
   added: (at ball28 room4) (free left)
   goals met: 14 of 34
56. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 14 of 34
57. (pick ball27 rooma left)
   deleted: (at ball27 rooma) (free left)
   added: (carry ball27 left)
   goals met: 14 of 34
58. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 14 of 34
59. (drop ball27 room4 left)
   deleted: (carry ball27 left)
   added: (at ball27 room4) (free left)
   goals met: 15 of 34
60. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 15 of 34
61. (pick ball26 rooma left)
   deleted: (at ball26 rooma) (free left)
   added: (carry ball26 left)
   goals met: 15 of 34
62. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 15 of 34
63. (drop ball26 room4 left)
   deleted: (carry ball26 left)
   added: (at ball26 room4) (free left)
   goals met: 16 of 34
64. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 16 of 34
65. (pick ball25 rooma left)
   deleted: (at ball25 rooma) (free left)
   added: (carry ball25 left)
   goals met: 16 of 34
66. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 16 of 34
67. (drop ball25 room4 left)
   deleted: (carry ball25 left)
   added: (at ball25 room4) (free left)
   goals met: 17 of 34
68. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 17 of 34
69. (pick ball24 rooma left)
   deleted: (at ball24 rooma) (free left)
   added: (carry ball24 left)
   goals met: 17 of 34
70. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 17 of 34
71. (drop ball24 room4 left)
   deleted: (carry ball24 left)
   added: (at ball24 room4) (free left)
   goals met: 18 of 34
72. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 18 of 34
73. (pick ball23 rooma left)
   deleted: (at ball23 rooma) (free left)
   added: (carry ball23 left)
   goals met: 18 of 34
74. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 18 of 34
75. (drop ball23 room4 left)
   deleted: (carry ball23 left)
   added: (at ball23 room4) (free left)
   goals met: 19 of 34
76. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 19 of 34
77. (pick ball22 rooma left)
   deleted: (at ball22 rooma) (free left)
   added: (carry ball22 left)
   goals met: 19 of 34
78. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 19 of 34
79. (drop ball22 room4 left)
   deleted: (carry ball22 left)
   added: (at ball22 room4) (free left)
   goals met: 20 of 34
80. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 20 of 34
81. (pick ball21 rooma left)
   deleted: (at ball21 rooma) (free left)
   added: (carry ball21 left)
   goals met: 20 of 34
82. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 20 of 34
83. (drop ball21 room4 left)
   deleted: (carry ball21 left)
   added: (at ball21 room4) (free left)
   goals met: 21 of 34
84. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 21 of 34
85. (pick ball20 rooma left)
   deleted: (at ball20 rooma) (free left)
   added: (carry ball20 left)
   goals met: 21 of 34
86. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 21 of 34
87. (drop ball20 room4 left)
   deleted: (carry ball20 left)
   added: (at ball20 room4) (free left)
   goals met: 22 of 34
88. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 22 of 34
89. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 22 of 34
90. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 22 of 34
91. (drop ball2 room4 left)
   deleted: (carry ball2 left)
   added: (at ball2 room4) (free left)
   goals met: 23 of 34
92. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 23 of 34
93. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 23 of 34
94. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 23 of 34
95. (drop ball19 room4 left)
   deleted: (carry ball19 left)
   added: (at ball19 room4) (free left)
   goals met: 24 of 34
96. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 24 of 34
97. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 24 of 34
98. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 24 of 34
99. (drop ball18 room4 left)
   deleted: (carry ball18 left)
   added: (at ball18 room4) (free left)
   goals met: 25 of 34
100. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 25 of 34
101. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 25 of 34
102. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 25 of 34
103. (drop ball17 room4 left)
   deleted: (carry ball17 left)
   added: (at ball17 room4) (free left)
   goals met: 26 of 34
104. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 26 of 34
105. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 26 of 34
106. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 26 of 34
107. (drop ball16 room4 left)
   deleted: (carry ball16 left)
   added: (at ball16 room4) (free left)
   goals met: 27 of 34
108. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 27 of 34
109. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 27 of 34
110. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 27 of 34
111. (drop ball15 room4 left)
   deleted: (carry ball15 left)
   added: (at ball15 room4) (free left)
   goals met: 28 of 34
112. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 28 of 34
113. (pick ball14 rooma left)
   deleted: (at ball14 rooma) (free left)
   added: (carry ball14 left)
   goals met: 28 of 34
114. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 28 of 34
115. (drop ball14 room4 left)
   deleted: (carry ball14 left)
   added: (at ball14 room4) (free left)
   goals met: 29 of 34
116. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 29 of 34
117. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 29 of 34
118. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 29 of 34
119. (drop ball13 room4 left)
   deleted: (carry ball13 left)
   added: (at ball13 room4) (free left)
   goals met: 30 of 34
120. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 30 of 34
121. (pick ball12 rooma left)
   deleted: (at ball12 rooma) (free left)
   added: (carry ball12 left)
   goals met: 30 of 34
122. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 30 of 34
123. (drop ball12 room4 left)
   deleted: (carry ball12 left)
   added: (at ball12 room4) (free left)
   goals met: 31 of 34
124. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 31 of 34
125. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 31 of 34
126. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 31 of 34
127. (drop ball11 room4 left)
   deleted: (carry ball11 left)
   added: (at ball11 room4) (free left)
   goals met: 32 of 34
128. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 32 of 34
129. (pick ball10 rooma left)
   deleted: (at ball10 rooma) (free left)
   added: (carry ball10 left)
   goals met: 32 of 34
130. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 32 of 34
131. (drop ball10 room4 left)
   deleted: (carry ball10 left)
   added: (at ball10 room4) (free left)
   goals met: 33 of 34
132. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 33 of 34
133. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 33 of 34
134. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 33 of 34
135. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 34 of 34
